Tekla Open API Reference for Tekla Structures 2025
Events.ModelObjectChangedDelegate Delegate
 The delegate to use for changed model objects. ModelObject inside ChangeData contains only identifier information. If properties need to be checked, Select() for object is required.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ModelObjectChangedDelegate(
	List<ChangeData> Changes
)
Public Delegate Sub ModelObjectChangedDelegate (
	Changes As List(Of ChangeData)
)
Parameters
Changes
Type: System.Collections.Generic.List<ChangeData>
See Also
Reference
Tekla.Structures.Model Namespace